### development Part # 1
  #### Terraform Format and Style 🖌`skipped`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/7425f170-1edd-4080-875a-31d0c3534e88/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_subnet.private[0] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0fe6bf1a3b96f8533"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.private[1] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-07eb078da6ab7d21e"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "Cashews-development-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_service.hello_world will be created
  + resource "aws_ecs_service" "hello_world" {
      + cluster                            = "arn:aws:ecs:us-west-1:012119841372:cluster/Cashews-development-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "hello-world-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + task_definition                    = "arn:aws:ecs:us-west-1:012119841372:task-definition/hello-world-app:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "hello-world-app"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:012119841372:targetgroup/hw-tg/05b93cd2cea7b946"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0f092658ed6b65643",
            ]
          + subnets          = [
              + "subnet-07eb078da6ab7d21e",
              + "subnet-0fe6bf1a3b96f8533",
            ]
        }
    }

  # aws_flow_log.default will be created
  + resource "aws_flow_log" "default" {
      + arn                      = (known after apply)
      + iam_role_arn             = "arn:aws:iam::012119841372:role/vpc-fl-role"
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-02e740c45eb470073"
    }

  # aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cashewhands-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.default will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.hello_world_task will be updated in-place
  ~ resource "aws_security_group" "hello_world_task" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Deny"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0f092658ed6b65643"
        name                   = "hw-task-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.service_security_group will be destroyed
  # (because aws_security_group.service_security_group is not in configuration)
  - resource "aws_security_group" "service_security_group" {
      - arn                    = "arn:aws:ec2:us-west-1:012119841372:security-group/sg-0566917def06d6eab" -> null
      - description            = "ECS Service security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound access"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0566917def06d6eab" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow inbound access"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0fc7591dff6b3d0dc",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "terraform-20221024133848541400000002" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "012119841372" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "Cashewhands"
          - "Project"       = "ECS-Deep-Dive"
          - "Purpose"       = "Further deploy ECS to AWS"
          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          - "Team"          = "Cashewhands"
          - "Terraform"     = "true"
        } -> null
      - vpc_id                 = "vpc-02e740c45eb470073" -> null
    }

Plan: 5 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # aws_subnet.private[0] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0fe6bf1a3b96f8533"%0A      + tags                                           = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.private[1] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-07eb078da6ab7d21e"%0A      + tags                                           = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.ecr will be created%0A  + resource "aws_ecr_repository" "ecr" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "Cashews-development-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "KMS"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecs_service.hello_world will be created%0A  + resource "aws_ecs_service" "hello_world" {%0A      + cluster                            = "arn:aws:ecs:us-west-1:012119841372:cluster/Cashews-development-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "hello-world-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-west-1:012119841372:task-definition/hello-world-app:1"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "hello-world-app"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:012119841372:targetgroup/hw-tg/05b93cd2cea7b946"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0f092658ed6b65643",%0A            ]%0A          + subnets          = [%0A              + "subnet-07eb078da6ab7d21e",%0A              + "subnet-0fe6bf1a3b96f8533",%0A            ]%0A        }%0A    }%0A%0A  # aws_flow_log.default will be created%0A  + resource "aws_flow_log" "default" {%0A      + arn                      = (known after apply)%0A      + iam_role_arn             = "arn:aws:iam::012119841372:role/vpc-fl-role"%0A      + id                       = (known after apply)%0A      + log_destination          = (known after apply)%0A      + log_destination_type     = "s3"%0A      + log_format               = (known after apply)%0A      + log_group_name           = (known after apply)%0A      + max_aggregation_interval = 600%0A      + tags_all                 = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + traffic_type             = "ALL"%0A      + vpc_id                   = "vpc-02e740c45eb470073"%0A    }%0A%0A  # aws_s3_bucket.default will be created%0A  + resource "aws_s3_bucket" "default" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "cashewhands-s3-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + apply_server_side_encryption_by_default {%0A                  + sse_algorithm = "AES256"%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = true%0A          + mfa_delete = false%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket_public_access_block.default will be created%0A  + resource "aws_s3_bucket_public_access_block" "default" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_security_group.hello_world_task will be updated in-place%0A  ~ resource "aws_security_group" "hello_world_task" {%0A      ~ egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "Deny"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Outbound"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A        id                     = "sg-0f092658ed6b65643"%0A        name                   = "hw-task-sg"%0A        tags                   = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.service_security_group will be destroyed%0A  # (because aws_security_group.service_security_group is not in configuration)%0A  - resource "aws_security_group" "service_security_group" {%0A      - arn                    = "arn:aws:ec2:us-west-1:012119841372:security-group/sg-0566917def06d6eab" -> null%0A      - description            = "ECS Service security group" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "Allow outbound access"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0566917def06d6eab" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - description      = "Allow inbound access"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = [%0A                  - "sg-0fc7591dff6b3d0dc",%0A                ]%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - name                   = "terraform-20221024133848541400000002" -> null%0A      - name_prefix            = "terraform-" -> null%0A      - owner_id               = "012119841372" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {%0A          - "Backup"        = "false"%0A          - "Environment"   = "development"%0A          - "Product-Owner" = "Cashewhands"%0A          - "Project"       = "ECS-Deep-Dive"%0A          - "Purpose"       = "Further deploy ECS to AWS"%0A          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          - "Team"          = "Cashewhands"%0A          - "Terraform"     = "true"%0A        } -> null%0A      - vpc_id                 = "vpc-02e740c45eb470073" -> null%0A    }%0A%0APlan: 5 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # aws_subnet.private[0] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0fe6bf1a3b96f8533"%0A      + tags                                           = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.private[1] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-07eb078da6ab7d21e"%0A      + tags                                           = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.ecr will be created%0A  + resource "aws_ecr_repository" "ecr" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "Cashews-development-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "KMS"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecs_service.hello_world will be created%0A  + resource "aws_ecs_service" "hello_world" {%0A      + cluster                            = "arn:aws:ecs:us-west-1:012119841372:cluster/Cashews-development-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "hello-world-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-west-1:012119841372:task-definition/hello-world-app:1"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "hello-world-app"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:012119841372:targetgroup/hw-tg/05b93cd2cea7b946"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0f092658ed6b65643",%0A            ]%0A          + subnets          = [%0A              + "subnet-07eb078da6ab7d21e",%0A              + "subnet-0fe6bf1a3b96f8533",%0A            ]%0A        }%0A    }%0A%0A  # aws_flow_log.default will be created%0A  + resource "aws_flow_log" "default" {%0A      + arn                      = (known after apply)%0A      + iam_role_arn             = "arn:aws:iam::012119841372:role/vpc-fl-role"%0A      + id                       = (known after apply)%0A      + log_destination          = (known after apply)%0A      + log_destination_type     = "s3"%0A      + log_format               = (known after apply)%0A      + log_group_name           = (known after apply)%0A      + max_aggregation_interval = 600%0A      + tags_all                 = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + traffic_type             = "ALL"%0A      + vpc_id                   = "vpc-02e740c45eb470073"%0A    }%0A%0A  # aws_s3_bucket.default will be created%0A  + resource "aws_s3_bucket" "default" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "cashewhands-s3-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + apply_server_side_encryption_by_default {%0A                  + sse_algorithm = "AES256"%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = true%0A          + mfa_delete = false%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket_public_access_block.default will be created%0A  + resource "aws_s3_bucket_public_access_block" "default" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_security_group.hello_world_task will be updated in-place%0A  ~ resource "aws_security_group" "hello_world_task" {%0A      ~ egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "Deny"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Outbound"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A        id                     = "sg-0f092658ed6b65643"%0A        name                   = "hw-task-sg"%0A        tags                   = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.service_security_group will be destroyed%0A  # (because aws_security_group.service_security_group is not in configuration)%0A  - resource "aws_security_group" "service_security_group" {%0A      - arn                    = "arn:aws:ec2:us-west-1:012119841372:security-group/sg-0566917def06d6eab" -> null%0A      - description            = "ECS Service security group" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "Allow outbound access"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0566917def06d6eab" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - description      = "Allow inbound access"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = [%0A                  - "sg-0fc7591dff6b3d0dc",%0A                ]%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - name                   = "terraform-20221024133848541400000002" -> null%0A      - name_prefix            = "terraform-" -> null%0A      - owner_id               = "012119841372" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {%0A          - "Backup"        = "false"%0A          - "Environment"   = "development"%0A          - "Product-Owner" = "Cashewhands"%0A          - "Project"       = "ECS-Deep-Dive"%0A          - "Purpose"       = "Further deploy ECS to AWS"%0A          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          - "Team"          = "Cashewhands"%0A          - "Terraform"     = "true"%0A        } -> null%0A      - vpc_id                 = "vpc-02e740c45eb470073" -> null%0A    }%0A%0APlan: 5 to add, 1 to change, 1 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0

  ```
  </details>
  *Pusher: @cashewhands, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*